;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! dired-open)
(package! dired-subtree)
(package! dotenv-mode)
(package! magit-delta)
(package! vlf)
(package! alert)
(package! ement)
(package! docker-compose-mode)

(package! detached)
(package! annotate)
(package! cape)
(package! consult-company)
(package! consult-projectile)
