;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; -----------------------------------
;; Theme
;; -----------------------------------
(package! catppuccin-theme)

;; -----------------------------------
;; Editing and utilities
;; -----------------------------------
(package! dotenv-mode)
(package! vlf)
(package! lorem-ipsum)

;; -----------------------------------
;; Dired
;; -----------------------------------
(package! dired-open)
(package! dired-subtree)

;; -----------------------------------
;; Magit
;; -----------------------------------
(package! magit-delta)
(package! glab)
(package! gtea)
(package! gogs)
(package! buck)

;; -----------------------------------
;; Notifications
;; -----------------------------------
(package! alert)
(package! org-alert)

;; -----------------------------------
;; Docker
;; -----------------------------------
(package! docker-compose-mode)

;; -----------------------------------
;; Background process
;; -----------------------------------
(package! detached)

;; -----------------------------------
;; Consult
;; -----------------------------------
(package! consult-company)
(package! consult-projectile)

;; -----------------------------------
;; LaTeX
;; -----------------------------------
(package! latexdiff)

;; -----------------------------------
;; Epub Reader
;; -----------------------------------
(package! nov)
(package! calibredb)

;; -----------------------------------
;; Elfeed
;; -----------------------------------
(package! elfeed-tube)
(package! elfeed-tube-mpv)

;; -----------------------------------
;; Javascript
;; -----------------------------------
(package! prettier-js)

;; -----------------------------------
;; IA
;; -----------------------------------
(package! gptel)
(package! ellama)
(package! llm) ; Dependency for ellama

;; -----------------------------------
;; Markdown
;; -----------------------------------
(package! markdown-soma)
(package! kdl-mode)
