;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; editor
(package! dotenv-mode)
(package! vlf)

;; dired
(package! dired-open)
(package! dired-subtree)

;; magit
(package! magit-delta)

;; notification
(package! alert)

;; docker
(package! docker-compose-mode)

;; detached
(package! detached)

;; consult
(package! consult-company)
(package! consult-projectile)

;; jabber
(package! jabber)
(package! srv) ;; jabber dependency
(package! fsm) ;; jabber dependency

;; latex
(package! latexdiff)
