;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; -----------------------------------
;; Paquetes para edición y utilidades
;; -----------------------------------
(package! dotenv-mode)
(package! vlf)
(package! lorem-ipsum)

;; -----------------------------------
;; Paquetes para Dired
;; -----------------------------------
(package! dired-open)
(package! dired-subtree)

;; -----------------------------------
;; Paquetes para Magit
;; -----------------------------------
(package! magit-delta)

;; -----------------------------------
;; Notificaciones
;; -----------------------------------
(package! alert)

;; -----------------------------------
;; Docker
;; -----------------------------------
(package! docker-compose-mode)

;; -----------------------------------
;; Proceso en segundo plano
;; -----------------------------------
(package! detached)

;; -----------------------------------
;; Consult y complementos
;; -----------------------------------
(package! consult-company)
(package! consult-projectile)

;; -----------------------------------
;; LaTeX
;; -----------------------------------
(package! latexdiff)
