;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; -----------------------------------
;; Editing and utilities
;; -----------------------------------
(package! dotenv-mode)
(package! vlf)
(package! lorem-ipsum)
(package! gtea)

;; -----------------------------------
;; Dired
;; -----------------------------------
(package! dired-open)
(package! dired-subtree)

;; -----------------------------------
;; Magit
;; -----------------------------------
(package! magit-delta)

;; -----------------------------------
;; Notifications
;; -----------------------------------
(package! alert)
(package! org-alert)

;; -----------------------------------
;; Docker
;; -----------------------------------
(package! docker-compose-mode)

;; -----------------------------------
;; Background process
;; -----------------------------------
(package! detached)

;; -----------------------------------
;; Consult
;; -----------------------------------
(package! consult-company)
(package! consult-projectile)

;; -----------------------------------
;; LaTeX
;; -----------------------------------
(package! latexdiff)

;; -----------------------------------
;; Epub Reader
;; -----------------------------------
(package! nov)
(package! calibredb)

;; -----------------------------------
;; Elfeed
;; -----------------------------------
(package! elfeed-tube)
(package! elfeed-tube-mpv)
